html/20231209T181842--perspective-and-denote-conflict__emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>perspective and denote conflict</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">perspective and denote conflict</h1>
<p>
I just figured out projectile and how cool is it, I can have a similar behavior
like tmux or default window os window management.
</p>

<p>
But the problem is when I create perspective frames and in those frames there
is at least one denote file. That frame does not get saved. Why? Because denote
purposfully by default renames it's buffers not to contain all the jibberish
like date when it was created, tag names and so on with this function -
<code>denote-rename-buffer-mode</code>.
</p>

<p>
Instead of such filename:
</p>

<ul class="org-ul">
<li>20231209T181842&#x2013;perspective-and-denote-conflict_<sub>emacs.org</sub></li>
</ul>

<p>
it renames it to:
</p>

<ul class="org-ul">
<li>perspective and denote conflict</li>
</ul>

<p>
And when you save in perspective the name of the buffer, it gets saved as this
short version which AFTER we try to open the saved perspective - it does not
find such filename, because it simply does not exist.
</p>

<p>
Nice I am happy that I could figure this out.
</p>

<p>
Let's try to change that variable and see if it helps.
</p>

<p>
Denote docs - <a href="https://protesilaos.com/emacs/denote#h:3ca4db16-8f26-4d7d-b748-bac48ae32d69">10. Automatically rename Denote buffers</a>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(denote-rename-buffer-mode -1)
</pre>
</div>

<p>
It did help!!! I am a magician!!
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-12-09 Sat 18:18</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
</div>
</body>
</html>